app/controllers/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT "animals".* FROM "animals"

  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save
---
INSERT INTO "animals" ("animalname", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["animalname", "Cat"], ["owner_id", 1], ["created_at", "2019-10-23 02:08:52.051727"], ["updated_at", "2019-10-23 02:08:52.051727"]]

    def set_animal
      @animal = Animal.find(params[:id])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]