app/controllers/diseases_controller.rb

  def index
    @diseases = Disease.all
---
SELECT "diseases".* FROM "diseases"

  def create
    @disease = Disease.new(disease_params)

    respond_to do |format|
      if @disease.save
---
INSERT INTO "diseases" ("diseasename", "created_at", "updated_at") VALUES (?, ?, ?)  [["diseasename", "Cold"], ["created_at", "2019-10-23 02:09:24.016047"], ["updated_at", "2019-10-23 02:09:24.016047"]]

    def set_disease
      @disease = Disease.find(params[:id])
---
SELECT "diseases".* FROM "diseases" WHERE "diseases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]