app/controllers/dois_controller.rb

SELECT "dois".* FROM "dois"
---
  def index
    @dois = Doi.all

INSERT INTO "dois" ("doidate", "animal_id", "disease_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["doidate", "2019-10-23"], ["animal_id", 1], ["disease_id", 1], ["created_at", "2019-10-23 02:09:34.046910"], ["updated_at", "2019-10-23 02:09:34.046910"]]
---
  def create
    @doi = Doi.new(doi_params)

    respond_to do |format|
      if @doi.save

SELECT "dois".* FROM "dois" WHERE "dois"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_doi
      @doi = Doi.find(params[:id])