app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
  def index
    @owners = Owner.all

INSERT INTO "owners" ("ownername", "created_at", "updated_at") VALUES (?, ?, ?)  [["ownername", "Div"], ["created_at", "2019-10-23 02:08:34.617347"], ["updated_at", "2019-10-23 02:08:34.617347"]]
---
  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save

SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_owner
      @owner = Owner.find(params[:id])